const strone = '季节-夏季，死亡率＞20%-无，发病率＞10%-无，传播迅速-有，体温异常-无，精神沉郁，精神亢奋-无，水肿-无，消瘦-无，昏迷-无，生长、发育不良-无，结膜炎-无，耳朵发绀-无，流鼻涕-无，鼻出血-无，频死期流血样鼻液或口鼻出血，面部溃烂-无，脸部变形-无，腹痛、不安-无，臌气-无，体表脓肿-无，蹄冠和蹄叉边缘红肿、有水泡、出血、溃烂、蹄壳脱落-无，关节炎-无，尾巴坏死-无，口吐、流白沫-无，呕吐-无，异食-无，腹泻、下痢-无，便秘-无，血便-无，粪便颜色-无，咳嗽-无，气喘-无，打喷嚏-无，毛孔处细小出血点-无，皮肤发炎、结痂、有水疱-无，皮肤红斑、块疹-无，皮肤不规则出血点-无，贫血-无，皮肤发绀、发红-无，黄疸、黄染-无，步态摇晃-无，神经症状-无，磨牙-无，肢蹄不敢负重站立，跛行、步态僵硬-无，早产、弱仔-无，流产、死胎、木乃伊胎-无，假发情、返情-无，断奶母猪不发情-无，乳房红、肿、热、痛或硬块-无，睾丸肿大-无，血尿-无，尿茶色-无'
const r1 = strone.match(/.*?-.*?，/g)

console.log(r1.filter(value => {
  if (!value.includes('-有') && !value.includes('-无')) return true
  return value.includes('-有')
}))